fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ВКМ_Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ВКМ_Числовой</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <schedule>InformationRegister.ВКМ_ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикиРаботы.Resource.РабочихДней</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделения</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикиРаботы.Resource.РабочихДней</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>DefinedType.ВКМ_Числовой</types>
    </type>
  </resources>
  <resources>
    <name>База</name>
    <type>
      <types>DefinedType.ВКМ_Числовой</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделения</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ВКМ_Числовой</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
//++Симбирёва О.С 02.07.26
	
	Сотрудники = Новый Массив;
	
	Для Каждого Строка Из ДополнительныеНачисления Цикл
		Сотрудники.Добавить(Строка.Сотрудник);
	КонецЦикла;
	
	СформироватьДвижения();
	
	РассчитатьНДФЛ(Сотрудники);
	
	РассчитатьНачисленияСотрудникам();
	
//--Симбирёва О.С 02.07.26
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	
//++Симбирёва О.С 02.07.26
	
	Для Каждого Строка Из ДополнительныеНачисления Цикл
		
		Если ТипЗнч(Строка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = Строка.ДатаНачала;
			Движение.ПериодДействияКонец = Строка.ДатаОкончания;
			Движение.ВидРасчета = Строка.ВидРасчета;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.Подразделение = Строка.Подразделение;
			Движение.Результат = Строка.Сумма;
			
			Движение = Движения.ВКМ_Удержания.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = Строка.ДатаНачала;
			Движение.ПериодДействияКонец = Строка.ДатаОкончания;
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.Подразделение = Строка.Подразделение;
			Движение.БазовыйПериодНачало = Строка.ДатаНачала;
			Движение.БазовыйПериодКонец = Строка.ДатаОкончания;
		КонецЕсли;
		
	КонецЦикла;

	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
	
//--Симбирёва О.С 02.07.26
	
КонецПроцедуры

Процедура РассчитатьНДФЛ(Сотрудники)
	
//++Симбирёва О.С 02.07.26
	
	Движения.ВКМ_Удержания.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Подразделение КАК Подразделение,
		|	СУММА(ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Результат, 0)) КАК Результат
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|	И ВКМ_ДополнительныеНачисления.Сотрудник В (&СписокСотрудников)
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ДополнительныеНачисления.Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Подразделение";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СписокСотрудников", Сотрудники);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ДатаНачала = Дата;
	ДатаОкончания = Дата;
	
	Для Каждого Строка Из ДополнительныеНачисления Цикл
		Если Строка.ДатаНачала < ДатаНачала Тогда
			ДатаНачала = Строка.ДатаНачала;
		КонецЕсли;
		Если Строка.ДатаОкончания > ДатаОкончания Тогда
			ДатаОкончания = Строка.ДатаОкончания;
		КонецЕсли;
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл
			
			Движение = Движения.ВКМ_Удержания.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = ДатаНачала;
			Движение.ПериодДействияКонец = ДатаОкончания;
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
			Движение.Сотрудник = Выборка.Сотрудник;
			Движение.Подразделение = Выборка.Подразделение;
			Движение.БазовыйПериодНачало = ДатаНачала;
			Движение.БазовыйПериодКонец = ДатаОкончания;
			
			Если Выборка.Результат = 0 Тогда
				Движение.Результат = 0;
				Движение.База = 0;
			Иначе
				СуммаНДФЛ = Окр(Выборка.Результат * 0.13, 2);
				Движение.Результат = -СуммаНДФЛ;
				Движение.База = Выборка.Результат;
			КонецЕсли;
					
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
//--Симбирёва О.С 02.07.26
	
КонецПроцедуры

Процедура РассчитатьНачисленияСотрудникам()
	
//++Симбирёва О.С 02.07.26
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДопНачисления.Сотрудник КАК Сотрудник,
		|	ДопНачисления.СуммаДопНачислений КАК СуммаДопНачислений,
		|	ЕСТЬNULL(Удержания.СуммаУдержаний, 0) КАК СуммаУдержаний
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|		СУММА(ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Результат, 0)) КАК СуммаДопНачислений
		|	ИЗ
		|		РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|	ГДЕ
		|		ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|	СГРУППИРОВАТЬ ПО
		|		ВКМ_ДополнительныеНачисления.Сотрудник
		|) КАК ДопНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВКМ_Удержания.Сотрудник КАК Сотрудник,
		|			СУММА(ЕСТЬNULL(ВКМ_Удержания.Результат, 0)) КАК СуммаУдержаний
		|		ИЗ
		|			РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ГДЕ
		|			ВКМ_Удержания.Регистратор = &Ссылка
		|		СГРУППИРОВАТЬ ПО
		|			ВКМ_Удержания.Сотрудник
		|	) КАК Удержания
		|		ПО ДопНачисления.Сотрудник = Удержания.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//регистр ВзаиморасчетыССотрудниками
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Сотрудник = Выборка.Сотрудник;
		СуммаДопНачислений = Выборка.СуммаДопНачислений;
		СуммаУдержаний = Выборка.СуммаУдержаний;
		
		ИтоговаяСумма = СуммаДопНачислений + СуммаУдержаний;
		
		Если ИтоговаяСумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Сотрудник;
		Движение.Сумма = ИтоговаяСумма;
		
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
//--Симбирёва О.С 02.07.26
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
